Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_bf.h
/** \brief Mask for Ifx_SPU_BE_PWRCTRL_Bits.RES */
#define IFX_SPU_BE_PWRCTRL_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_BE_PWRCTRL_Bits.RES */
#define IFX_SPU_BE_PWRCTRL_RES_OFF (19u)

/** \brief Length for Ifx_SPU_BE_PWRCTRL_Bits.EN */
#define IFX_SPU_BE_PWRCTRL_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_BE_PWRCTRL_Bits.EN */
#define IFX_SPU_BE_PWRCTRL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BE_PWRCTRL_Bits.EN */
#define IFX_SPU_BE_PWRCTRL_EN_OFF (31u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.BASE */
#define IFX_SPU_BE_CFARCTRL_BASE_LEN (19u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.BASE */
#define IFX_SPU_BE_CFARCTRL_BASE_MSK (0x7ffffu)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.BASE */
#define IFX_SPU_BE_CFARCTRL_BASE_OFF (0u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.SEWIN */
#define IFX_SPU_BE_CFARCTRL_SEWIN_LEN (6u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.SEWIN */
#define IFX_SPU_BE_CFARCTRL_SEWIN_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.SEWIN */
#define IFX_SPU_BE_CFARCTRL_SEWIN_OFF (19u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.EXTNSN */
#define IFX_SPU_BE_CFARCTRL_EXTNSN_LEN (2u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.EXTNSN */
#define IFX_SPU_BE_CFARCTRL_EXTNSN_MSK (0x3u)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.EXTNSN */
#define IFX_SPU_BE_CFARCTRL_EXTNSN_OFF (25u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_CAE */
#define IFX_SPU_BE_CFARCTRL_CFAR_CAE_LEN (1u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_CAE */
#define IFX_SPU_BE_CFARCTRL_CFAR_CAE_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_CAE */
#define IFX_SPU_BE_CFARCTRL_CFAR_CAE_OFF (27u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_GOSE */
#define IFX_SPU_BE_CFARCTRL_CFAR_GOSE_LEN (1u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_GOSE */
#define IFX_SPU_BE_CFARCTRL_CFAR_GOSE_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_GOSE */
#define IFX_SPU_BE_CFARCTRL_CFAR_GOSE_OFF (28u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.CFAREN */
#define IFX_SPU_BE_CFARCTRL_CFAREN_LEN (3u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.CFAREN */
#define IFX_SPU_BE_CFARCTRL_CFAREN_MSK (0x7u)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.CFAREN */
#define IFX_SPU_BE_CFARCTRL_CFAREN_OFF (29u)

/** \brief Length for Ifx_SPU_BE_SBCTRL_Bits.BASE */
#define IFX_SPU_BE_SBCTRL_BASE_LEN (19u)

/** \brief Mask for Ifx_SPU_BE_SBCTRL_Bits.BASE */
#define IFX_SPU_BE_SBCTRL_BASE_MSK (0x7ffffu)

/** \brief Offset for Ifx_SPU_BE_SBCTRL_Bits.BASE */
#define IFX_SPU_BE_SBCTRL_BASE_OFF (0u)

/** \brief Length for Ifx_SPU_BE_SBCTRL_Bits.RES */
#define IFX_SPU_BE_SBCTRL_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_BE_SBCTRL_Bits.RES */
#define IFX_SPU_BE_SBCTRL_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_BE_SBCTRL_Bits.RES */
#define IFX_SPU_BE_SBCTRL_RES_OFF (19u)

/** \brief Length for Ifx_SPU_BE_SBCTRL_Bits.EN */
#define IFX_SPU_BE_SBCTRL_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_BE_SBCTRL_Bits.EN */
#define IFX_SPU_BE_SBCTRL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BE_SBCTRL_Bits.EN */
#define IFX_SPU_BE_SBCTRL_EN_OFF (31u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B0_R0 */
#define IFX_SPU_BIN_REJ_B0_R0_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B0_R0 */
#define IFX_SPU_BIN_REJ_B0_R0_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B0_R0 */
#define IFX_SPU_BIN_REJ_B0_R0_OFF (0u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B1_R1 */
#define IFX_SPU_BIN_REJ_B1_R1_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B1_R1 */
#define IFX_SPU_BIN_REJ_B1_R1_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B1_R1 */
#define IFX_SPU_BIN_REJ_B1_R1_OFF (1u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B2_R2 */
#define IFX_SPU_BIN_REJ_B2_R2_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B2_R2 */
#define IFX_SPU_BIN_REJ_B2_R2_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B2_R2 */
#define IFX_SPU_BIN_REJ_B2_R2_OFF (2u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B3_R3 */
#define IFX_SPU_BIN_REJ_B3_R3_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B3_R3 */
#define IFX_SPU_BIN_REJ_B3_R3_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B3_R3 */
#define IFX_SPU_BIN_REJ_B3_R3_OFF (3u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B4_R4 */
#define IFX_SPU_BIN_REJ_B4_R4_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B4_R4 */
#define IFX_SPU_BIN_REJ_B4_R4_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B4_R4 */
#define IFX_SPU_BIN_REJ_B4_R4_OFF (4u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B5_R5 */
#define IFX_SPU_BIN_REJ_B5_R5_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B5_R5 */
#define IFX_SPU_BIN_REJ_B5_R5_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B5_R5 */
#define IFX_SPU_BIN_REJ_B5_R5_OFF (5u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B6_R6 */
#define IFX_SPU_BIN_REJ_B6_R6_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B6_R6 */
#define IFX_SPU_BIN_REJ_B6_R6_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B6_R6 */
#define IFX_SPU_BIN_REJ_B6_R6_OFF (6u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B7_R7 */
#define IFX_SPU_BIN_REJ_B7_R7_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B7_R7 */
#define IFX_SPU_BIN_REJ_B7_R7_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B7_R7 */
#define IFX_SPU_BIN_REJ_B7_R7_OFF (7u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B8_R8 */
#define IFX_SPU_BIN_REJ_B8_R8_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B8_R8 */
#define IFX_SPU_BIN_REJ_B8_R8_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B8_R8 */
#define IFX_SPU_BIN_REJ_B8_R8_OFF (8u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B9_R9 */
#define IFX_SPU_BIN_REJ_B9_R9_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B9_R9 */
#define IFX_SPU_BIN_REJ_B9_R9_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B9_R9 */
#define IFX_SPU_BIN_REJ_B9_R9_OFF (9u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B10_R10 */
#define IFX_SPU_BIN_REJ_B10_R10_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B10_R10 */
#define IFX_SPU_BIN_REJ_B10_R10_MSK (0x1u)

