Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_bf.h
/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B10_R10 */
#define IFX_SPU_BIN_REJ_B10_R10_OFF (10u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B11_R11 */
#define IFX_SPU_BIN_REJ_B11_R11_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B11_R11 */
#define IFX_SPU_BIN_REJ_B11_R11_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B11_R11 */
#define IFX_SPU_BIN_REJ_B11_R11_OFF (11u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B12_R12 */
#define IFX_SPU_BIN_REJ_B12_R12_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B12_R12 */
#define IFX_SPU_BIN_REJ_B12_R12_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B12_R12 */
#define IFX_SPU_BIN_REJ_B12_R12_OFF (12u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B13_R13 */
#define IFX_SPU_BIN_REJ_B13_R13_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B13_R13 */
#define IFX_SPU_BIN_REJ_B13_R13_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B13_R13 */
#define IFX_SPU_BIN_REJ_B13_R13_OFF (13u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B14_R14 */
#define IFX_SPU_BIN_REJ_B14_R14_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B14_R14 */
#define IFX_SPU_BIN_REJ_B14_R14_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B14_R14 */
#define IFX_SPU_BIN_REJ_B14_R14_OFF (14u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B15_R15 */
#define IFX_SPU_BIN_REJ_B15_R15_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B15_R15 */
#define IFX_SPU_BIN_REJ_B15_R15_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B15_R15 */
#define IFX_SPU_BIN_REJ_B15_R15_OFF (15u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B16_R16 */
#define IFX_SPU_BIN_REJ_B16_R16_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B16_R16 */
#define IFX_SPU_BIN_REJ_B16_R16_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B16_R16 */
#define IFX_SPU_BIN_REJ_B16_R16_OFF (16u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B17_R17 */
#define IFX_SPU_BIN_REJ_B17_R17_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B17_R17 */
#define IFX_SPU_BIN_REJ_B17_R17_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B17_R17 */
#define IFX_SPU_BIN_REJ_B17_R17_OFF (17u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B18_R18 */
#define IFX_SPU_BIN_REJ_B18_R18_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B18_R18 */
#define IFX_SPU_BIN_REJ_B18_R18_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B18_R18 */
#define IFX_SPU_BIN_REJ_B18_R18_OFF (18u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B19_R19 */
#define IFX_SPU_BIN_REJ_B19_R19_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B19_R19 */
#define IFX_SPU_BIN_REJ_B19_R19_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B19_R19 */
#define IFX_SPU_BIN_REJ_B19_R19_OFF (19u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B20_R20 */
#define IFX_SPU_BIN_REJ_B20_R20_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B20_R20 */
#define IFX_SPU_BIN_REJ_B20_R20_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B20_R20 */
#define IFX_SPU_BIN_REJ_B20_R20_OFF (20u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B21_R21 */
#define IFX_SPU_BIN_REJ_B21_R21_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B21_R21 */
#define IFX_SPU_BIN_REJ_B21_R21_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B21_R21 */
#define IFX_SPU_BIN_REJ_B21_R21_OFF (21u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B22_R22 */
#define IFX_SPU_BIN_REJ_B22_R22_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B22_R22 */
#define IFX_SPU_BIN_REJ_B22_R22_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B22_R22 */
#define IFX_SPU_BIN_REJ_B22_R22_OFF (22u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B23_R23 */
#define IFX_SPU_BIN_REJ_B23_R23_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B23_R23 */
#define IFX_SPU_BIN_REJ_B23_R23_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B23_R23 */
#define IFX_SPU_BIN_REJ_B23_R23_OFF (23u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B24_R24 */
#define IFX_SPU_BIN_REJ_B24_R24_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B24_R24 */
#define IFX_SPU_BIN_REJ_B24_R24_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B24_R24 */
#define IFX_SPU_BIN_REJ_B24_R24_OFF (24u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B25_R25 */
#define IFX_SPU_BIN_REJ_B25_R25_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B25_R25 */
#define IFX_SPU_BIN_REJ_B25_R25_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B25_R25 */
#define IFX_SPU_BIN_REJ_B25_R25_OFF (25u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B26_R26 */
#define IFX_SPU_BIN_REJ_B26_R26_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B26_R26 */
#define IFX_SPU_BIN_REJ_B26_R26_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B26_R26 */
#define IFX_SPU_BIN_REJ_B26_R26_OFF (26u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B27_R27 */
#define IFX_SPU_BIN_REJ_B27_R27_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B27_R27 */
#define IFX_SPU_BIN_REJ_B27_R27_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B27_R27 */
#define IFX_SPU_BIN_REJ_B27_R27_OFF (27u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B28_R28 */
#define IFX_SPU_BIN_REJ_B28_R28_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B28_R28 */
#define IFX_SPU_BIN_REJ_B28_R28_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B28_R28 */
#define IFX_SPU_BIN_REJ_B28_R28_OFF (28u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B29_R29 */
#define IFX_SPU_BIN_REJ_B29_R29_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B29_R29 */
#define IFX_SPU_BIN_REJ_B29_R29_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B29_R29 */
#define IFX_SPU_BIN_REJ_B29_R29_OFF (29u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B30_R30 */
#define IFX_SPU_BIN_REJ_B30_R30_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B30_R30 */
#define IFX_SPU_BIN_REJ_B30_R30_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B30_R30 */
#define IFX_SPU_BIN_REJ_B30_R30_OFF (30u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B31_R31 */
#define IFX_SPU_BIN_REJ_B31_R31_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B31_R31 */
#define IFX_SPU_BIN_REJ_B31_R31_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B31_R31 */
#define IFX_SPU_BIN_REJ_B31_R31_OFF (31u)

