Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_bf.h
/** \brief Length for Ifx_SPU_MAGAPPROX_Bits.ALPHA */
#define IFX_SPU_MAGAPPROX_ALPHA_LEN (16u)

/** \brief Mask for Ifx_SPU_MAGAPPROX_Bits.ALPHA */
#define IFX_SPU_MAGAPPROX_ALPHA_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_MAGAPPROX_Bits.ALPHA */
#define IFX_SPU_MAGAPPROX_ALPHA_OFF (0u)

/** \brief Length for Ifx_SPU_MAGAPPROX_Bits.BETA */
#define IFX_SPU_MAGAPPROX_BETA_LEN (16u)

/** \brief Mask for Ifx_SPU_MAGAPPROX_Bits.BETA */
#define IFX_SPU_MAGAPPROX_BETA_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_MAGAPPROX_Bits.BETA */
#define IFX_SPU_MAGAPPROX_BETA_OFF (16u)

/** \brief Length for Ifx_SPU_NCISCALAR0_Bits.ANT0 */
#define IFX_SPU_NCISCALAR0_ANT0_LEN (16u)

/** \brief Mask for Ifx_SPU_NCISCALAR0_Bits.ANT0 */
#define IFX_SPU_NCISCALAR0_ANT0_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCISCALAR0_Bits.ANT0 */
#define IFX_SPU_NCISCALAR0_ANT0_OFF (0u)

/** \brief Length for Ifx_SPU_NCISCALAR0_Bits.ANT1 */
#define IFX_SPU_NCISCALAR0_ANT1_LEN (16u)

/** \brief Mask for Ifx_SPU_NCISCALAR0_Bits.ANT1 */
#define IFX_SPU_NCISCALAR0_ANT1_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCISCALAR0_Bits.ANT1 */
#define IFX_SPU_NCISCALAR0_ANT1_OFF (16u)

/** \brief Length for Ifx_SPU_NCISCALAR1_Bits.ANT2 */
#define IFX_SPU_NCISCALAR1_ANT2_LEN (16u)

/** \brief Mask for Ifx_SPU_NCISCALAR1_Bits.ANT2 */
#define IFX_SPU_NCISCALAR1_ANT2_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCISCALAR1_Bits.ANT2 */
#define IFX_SPU_NCISCALAR1_ANT2_OFF (0u)

/** \brief Length for Ifx_SPU_NCISCALAR1_Bits.ANT3 */
#define IFX_SPU_NCISCALAR1_ANT3_LEN (16u)

/** \brief Mask for Ifx_SPU_NCISCALAR1_Bits.ANT3 */
#define IFX_SPU_NCISCALAR1_ANT3_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCISCALAR1_Bits.ANT3 */
#define IFX_SPU_NCISCALAR1_ANT3_OFF (16u)

/** \brief Length for Ifx_SPU_NCISCALAR2_Bits.ANT4 */
#define IFX_SPU_NCISCALAR2_ANT4_LEN (16u)

/** \brief Mask for Ifx_SPU_NCISCALAR2_Bits.ANT4 */
#define IFX_SPU_NCISCALAR2_ANT4_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCISCALAR2_Bits.ANT4 */
#define IFX_SPU_NCISCALAR2_ANT4_OFF (0u)

/** \brief Length for Ifx_SPU_NCISCALAR2_Bits.ANT5 */
#define IFX_SPU_NCISCALAR2_ANT5_LEN (16u)

/** \brief Mask for Ifx_SPU_NCISCALAR2_Bits.ANT5 */
#define IFX_SPU_NCISCALAR2_ANT5_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCISCALAR2_Bits.ANT5 */
#define IFX_SPU_NCISCALAR2_ANT5_OFF (16u)

/** \brief Length for Ifx_SPU_NCISCALAR3_Bits.ANT6 */
#define IFX_SPU_NCISCALAR3_ANT6_LEN (16u)

/** \brief Mask for Ifx_SPU_NCISCALAR3_Bits.ANT6 */
#define IFX_SPU_NCISCALAR3_ANT6_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCISCALAR3_Bits.ANT6 */
#define IFX_SPU_NCISCALAR3_ANT6_OFF (0u)

/** \brief Length for Ifx_SPU_NCISCALAR3_Bits.ANT7 */
#define IFX_SPU_NCISCALAR3_ANT7_LEN (16u)

/** \brief Mask for Ifx_SPU_NCISCALAR3_Bits.ANT7 */
#define IFX_SPU_NCISCALAR3_ANT7_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCISCALAR3_Bits.ANT7 */
#define IFX_SPU_NCISCALAR3_ANT7_OFF (16u)

/** \brief Length for Ifx_SPU_CFARCFG_Bits.CAALGO */
#define IFX_SPU_CFARCFG_CAALGO_LEN (2u)

/** \brief Mask for Ifx_SPU_CFARCFG_Bits.CAALGO */
#define IFX_SPU_CFARCFG_CAALGO_MSK (0x3u)

/** \brief Offset for Ifx_SPU_CFARCFG_Bits.CAALGO */
#define IFX_SPU_CFARCFG_CAALGO_OFF (0u)

/** \brief Length for Ifx_SPU_CFARCFG_Bits.GOSALGO */
#define IFX_SPU_CFARCFG_GOSALGO_LEN (2u)

/** \brief Mask for Ifx_SPU_CFARCFG_Bits.GOSALGO */
#define IFX_SPU_CFARCFG_GOSALGO_MSK (0x3u)

/** \brief Offset for Ifx_SPU_CFARCFG_Bits.GOSALGO */
#define IFX_SPU_CFARCFG_GOSALGO_OFF (2u)

/** \brief Length for Ifx_SPU_CFARCFG_Bits.CAGUARD */
#define IFX_SPU_CFARCFG_CAGUARD_LEN (6u)

/** \brief Mask for Ifx_SPU_CFARCFG_Bits.CAGUARD */
#define IFX_SPU_CFARCFG_CAGUARD_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_CFARCFG_Bits.CAGUARD */
#define IFX_SPU_CFARCFG_CAGUARD_OFF (4u)

/** \brief Length for Ifx_SPU_CFARCFG_Bits.CAWINCELL */
#define IFX_SPU_CFARCFG_CAWINCELL_LEN (3u)

/** \brief Mask for Ifx_SPU_CFARCFG_Bits.CAWINCELL */
#define IFX_SPU_CFARCFG_CAWINCELL_MSK (0x7u)

/** \brief Offset for Ifx_SPU_CFARCFG_Bits.CAWINCELL */
#define IFX_SPU_CFARCFG_CAWINCELL_OFF (10u)

/** \brief Length for Ifx_SPU_CFARCFG_Bits.RES */
#define IFX_SPU_CFARCFG_RES_LEN (1u)

/** \brief Mask for Ifx_SPU_CFARCFG_Bits.RES */
#define IFX_SPU_CFARCFG_RES_MSK (0x1u)

/** \brief Offset for Ifx_SPU_CFARCFG_Bits.RES */
#define IFX_SPU_CFARCFG_RES_OFF (13u)

/** \brief Length for Ifx_SPU_CFARCFG_Bits.CFARSEL */
#define IFX_SPU_CFARCFG_CFARSEL_LEN (2u)

/** \brief Mask for Ifx_SPU_CFARCFG_Bits.CFARSEL */
#define IFX_SPU_CFARCFG_CFARSEL_MSK (0x3u)

/** \brief Offset for Ifx_SPU_CFARCFG_Bits.CFARSEL */
#define IFX_SPU_CFARCFG_CFARSEL_OFF (14u)

/** \brief Length for Ifx_SPU_CFARCFG_Bits.CABETA */
#define IFX_SPU_CFARCFG_CABETA_LEN (16u)

/** \brief Mask for Ifx_SPU_CFARCFG_Bits.CABETA */
#define IFX_SPU_CFARCFG_CABETA_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_CFARCFG_Bits.CABETA */
#define IFX_SPU_CFARCFG_CABETA_OFF (16u)

/** \brief Length for Ifx_SPU_CFARCFG2_Bits.GOSGUARD */
#define IFX_SPU_CFARCFG2_GOSGUARD_LEN (6u)

/** \brief Mask for Ifx_SPU_CFARCFG2_Bits.GOSGUARD */
#define IFX_SPU_CFARCFG2_GOSGUARD_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_CFARCFG2_Bits.GOSGUARD */
#define IFX_SPU_CFARCFG2_GOSGUARD_OFF (0u)

/** \brief Length for Ifx_SPU_CFARCFG2_Bits.IDXLD */
#define IFX_SPU_CFARCFG2_IDXLD_LEN (5u)

/** \brief Mask for Ifx_SPU_CFARCFG2_Bits.IDXLD */
#define IFX_SPU_CFARCFG2_IDXLD_MSK (0x1fu)

/** \brief Offset for Ifx_SPU_CFARCFG2_Bits.IDXLD */
#define IFX_SPU_CFARCFG2_IDXLD_OFF (6u)

/** \brief Length for Ifx_SPU_CFARCFG2_Bits.IDXLG */
#define IFX_SPU_CFARCFG2_IDXLG_LEN (5u)

/** \brief Mask for Ifx_SPU_CFARCFG2_Bits.IDXLG */
#define IFX_SPU_CFARCFG2_IDXLG_MSK (0x1fu)

/** \brief Offset for Ifx_SPU_CFARCFG2_Bits.IDXLG */
#define IFX_SPU_CFARCFG2_IDXLG_OFF (11u)

/** \brief Length for Ifx_SPU_CFARCFG2_Bits.GOSWINCELL */
#define IFX_SPU_CFARCFG2_GOSWINCELL_LEN (6u)

/** \brief Mask for Ifx_SPU_CFARCFG2_Bits.GOSWINCELL */
#define IFX_SPU_CFARCFG2_GOSWINCELL_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_CFARCFG2_Bits.GOSWINCELL */
#define IFX_SPU_CFARCFG2_GOSWINCELL_OFF (16u)

/** \brief Length for Ifx_SPU_CFARCFG2_Bits.CASHWIN */
#define IFX_SPU_CFARCFG2_CASHWIN_LEN (3u)

/** \brief Mask for Ifx_SPU_CFARCFG2_Bits.CASHWIN */
#define IFX_SPU_CFARCFG2_CASHWIN_MSK (0x7u)

/** \brief Offset for Ifx_SPU_CFARCFG2_Bits.CASHWIN */
#define IFX_SPU_CFARCFG2_CASHWIN_OFF (22u)

