Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_bf.h
/** \brief Offset for Ifx_SPU_CTRL_Bits.LAST */
#define IFX_SPU_CTRL_LAST_OFF (31u)

/** \brief Length for Ifx_SPU_MD_METADATA_Bits.SMPLCNT */
#define IFX_SPU_MD_METADATA_SMPLCNT_LEN (12u)

/** \brief Mask for Ifx_SPU_MD_METADATA_Bits.SMPLCNT */
#define IFX_SPU_MD_METADATA_SMPLCNT_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_MD_METADATA_Bits.SMPLCNT */
#define IFX_SPU_MD_METADATA_SMPLCNT_OFF (0u)

/** \brief Length for Ifx_SPU_MD_METADATA_Bits.RES */
#define IFX_SPU_MD_METADATA_RES_LEN (4u)

/** \brief Mask for Ifx_SPU_MD_METADATA_Bits.RES */
#define IFX_SPU_MD_METADATA_RES_MSK (0xfu)

/** \brief Offset for Ifx_SPU_MD_METADATA_Bits.RES */
#define IFX_SPU_MD_METADATA_RES_OFF (12u)

/** \brief Length for Ifx_SPU_MD_METADATA_Bits.EXPNT */
#define IFX_SPU_MD_METADATA_EXPNT_LEN (5u)

/** \brief Mask for Ifx_SPU_MD_METADATA_Bits.EXPNT */
#define IFX_SPU_MD_METADATA_EXPNT_MSK (0x1fu)

/** \brief Offset for Ifx_SPU_MD_METADATA_Bits.EXPNT */
#define IFX_SPU_MD_METADATA_EXPNT_OFF (16u)

/** \brief Length for Ifx_SPU_IDMCNT_Bits.CNT */
#define IFX_SPU_IDMCNT_CNT_LEN (20u)

/** \brief Mask for Ifx_SPU_IDMCNT_Bits.CNT */
#define IFX_SPU_IDMCNT_CNT_MSK (0xfffffu)

/** \brief Offset for Ifx_SPU_IDMCNT_Bits.CNT */
#define IFX_SPU_IDMCNT_CNT_OFF (0u)

/** \brief Length for Ifx_SPU_IDMCNT_Bits.RES */
#define IFX_SPU_IDMCNT_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_IDMCNT_Bits.RES */
#define IFX_SPU_IDMCNT_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_IDMCNT_Bits.RES */
#define IFX_SPU_IDMCNT_RES_OFF (20u)

/** \brief Length for Ifx_SPU_IBMCNT_Bits.CNT */
#define IFX_SPU_IBMCNT_CNT_LEN (20u)

/** \brief Mask for Ifx_SPU_IBMCNT_Bits.CNT */
#define IFX_SPU_IBMCNT_CNT_MSK (0xfffffu)

/** \brief Offset for Ifx_SPU_IBMCNT_Bits.CNT */
#define IFX_SPU_IBMCNT_CNT_OFF (0u)

/** \brief Length for Ifx_SPU_IBMCNT_Bits.RES */
#define IFX_SPU_IBMCNT_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_IBMCNT_Bits.RES */
#define IFX_SPU_IBMCNT_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_IBMCNT_Bits.RES */
#define IFX_SPU_IBMCNT_RES_OFF (20u)

/** \brief Length for Ifx_SPU_LDRCNT_Bits.CNT */
#define IFX_SPU_LDRCNT_CNT_LEN (20u)

/** \brief Mask for Ifx_SPU_LDRCNT_Bits.CNT */
#define IFX_SPU_LDRCNT_CNT_MSK (0xfffffu)

/** \brief Offset for Ifx_SPU_LDRCNT_Bits.CNT */
#define IFX_SPU_LDRCNT_CNT_OFF (0u)

/** \brief Length for Ifx_SPU_LDRCNT_Bits.RES */
#define IFX_SPU_LDRCNT_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_LDRCNT_Bits.RES */
#define IFX_SPU_LDRCNT_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_LDRCNT_Bits.RES */
#define IFX_SPU_LDRCNT_RES_OFF (20u)

/** \brief Length for Ifx_SPU_FFTWCNT_Bits.CNT */
#define IFX_SPU_FFTWCNT_CNT_LEN (20u)

/** \brief Mask for Ifx_SPU_FFTWCNT_Bits.CNT */
#define IFX_SPU_FFTWCNT_CNT_MSK (0xfffffu)

/** \brief Offset for Ifx_SPU_FFTWCNT_Bits.CNT */
#define IFX_SPU_FFTWCNT_CNT_OFF (0u)

/** \brief Length for Ifx_SPU_FFTWCNT_Bits.RES */
#define IFX_SPU_FFTWCNT_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_FFTWCNT_Bits.RES */
#define IFX_SPU_FFTWCNT_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_FFTWCNT_Bits.RES */
#define IFX_SPU_FFTWCNT_RES_OFF (20u)

/** \brief Length for Ifx_SPU_FFTRCNT_Bits.CNT */
#define IFX_SPU_FFTRCNT_CNT_LEN (20u)

/** \brief Mask for Ifx_SPU_FFTRCNT_Bits.CNT */
#define IFX_SPU_FFTRCNT_CNT_MSK (0xfffffu)

/** \brief Offset for Ifx_SPU_FFTRCNT_Bits.CNT */
#define IFX_SPU_FFTRCNT_CNT_OFF (0u)

/** \brief Length for Ifx_SPU_FFTRCNT_Bits.RES */
#define IFX_SPU_FFTRCNT_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_FFTRCNT_Bits.RES */
#define IFX_SPU_FFTRCNT_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_FFTRCNT_Bits.RES */
#define IFX_SPU_FFTRCNT_RES_OFF (20u)

/** \brief Length for Ifx_SPU_ULDRCNT_Bits.CNT */
#define IFX_SPU_ULDRCNT_CNT_LEN (20u)

/** \brief Mask for Ifx_SPU_ULDRCNT_Bits.CNT */
#define IFX_SPU_ULDRCNT_CNT_MSK (0xfffffu)

/** \brief Offset for Ifx_SPU_ULDRCNT_Bits.CNT */
#define IFX_SPU_ULDRCNT_CNT_OFF (0u)

/** \brief Length for Ifx_SPU_ULDRCNT_Bits.RES */
#define IFX_SPU_ULDRCNT_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_ULDRCNT_Bits.RES */
#define IFX_SPU_ULDRCNT_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_ULDRCNT_Bits.RES */
#define IFX_SPU_ULDRCNT_RES_OFF (20u)

/** \brief Length for Ifx_SPU_ODMCNT_Bits.CNT */
#define IFX_SPU_ODMCNT_CNT_LEN (20u)

/** \brief Mask for Ifx_SPU_ODMCNT_Bits.CNT */
#define IFX_SPU_ODMCNT_CNT_MSK (0xfffffu)

/** \brief Offset for Ifx_SPU_ODMCNT_Bits.CNT */
#define IFX_SPU_ODMCNT_CNT_OFF (0u)

/** \brief Length for Ifx_SPU_ODMCNT_Bits.RES */
#define IFX_SPU_ODMCNT_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_ODMCNT_Bits.RES */
#define IFX_SPU_ODMCNT_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_ODMCNT_Bits.RES */
#define IFX_SPU_ODMCNT_RES_OFF (20u)

/** \brief Length for Ifx_SPU_BRCNT_Bits.CNT */
#define IFX_SPU_BRCNT_CNT_LEN (20u)

/** \brief Mask for Ifx_SPU_BRCNT_Bits.CNT */
#define IFX_SPU_BRCNT_CNT_MSK (0xfffffu)

/** \brief Offset for Ifx_SPU_BRCNT_Bits.CNT */
#define IFX_SPU_BRCNT_CNT_OFF (0u)

/** \brief Length for Ifx_SPU_BRCNT_Bits.RES */
#define IFX_SPU_BRCNT_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_BRCNT_Bits.RES */
#define IFX_SPU_BRCNT_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_BRCNT_Bits.RES */
#define IFX_SPU_BRCNT_RES_OFF (20u)

/** \brief Length for Ifx_SPU_CFARCNT_Bits.CNT */
#define IFX_SPU_CFARCNT_CNT_LEN (20u)

/** \brief Mask for Ifx_SPU_CFARCNT_Bits.CNT */
#define IFX_SPU_CFARCNT_CNT_MSK (0xfffffu)

/** \brief Offset for Ifx_SPU_CFARCNT_Bits.CNT */
#define IFX_SPU_CFARCNT_CNT_OFF (0u)

/** \brief Length for Ifx_SPU_CFARCNT_Bits.RES */
#define IFX_SPU_CFARCNT_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_CFARCNT_Bits.RES */
#define IFX_SPU_CFARCNT_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_CFARCNT_Bits.RES */
#define IFX_SPU_CFARCNT_RES_OFF (20u)

/** \brief Length for Ifx_SPU_ODMACNT_ODMACNT_Bits.CNT */
#define IFX_SPU_ODMACNT_ODMACNT_CNT_LEN (20u)

/** \brief Mask for Ifx_SPU_ODMACNT_ODMACNT_Bits.CNT */
#define IFX_SPU_ODMACNT_ODMACNT_CNT_MSK (0xfffffu)

/** \brief Offset for Ifx_SPU_ODMACNT_ODMACNT_Bits.CNT */
#define IFX_SPU_ODMACNT_ODMACNT_CNT_OFF (0u)

/** \brief Length for Ifx_SPU_ODMACNT_ODMACNT_Bits.RES */
#define IFX_SPU_ODMACNT_ODMACNT_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_ODMACNT_ODMACNT_Bits.RES */
#define IFX_SPU_ODMACNT_ODMACNT_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_ODMACNT_ODMACNT_Bits.RES */
#define IFX_SPU_ODMACNT_ODMACNT_RES_OFF (20u)

/** \brief Length for Ifx_SPU_CNTCLR_Bits.CLR */
#define IFX_SPU_CNTCLR_CLR_LEN (2u)

/** \brief Mask for Ifx_SPU_CNTCLR_Bits.CLR */
#define IFX_SPU_CNTCLR_CLR_MSK (0x3u)

