Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_bf.h
/** \brief Offset for Ifx_SPU_CNTCLR_Bits.CLR */
#define IFX_SPU_CNTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_SPU_CNTCLR_Bits.RES */
#define IFX_SPU_CNTCLR_RES_LEN (30u)

/** \brief Mask for Ifx_SPU_CNTCLR_Bits.RES */
#define IFX_SPU_CNTCLR_RES_MSK (0x3fffffffu)

/** \brief Offset for Ifx_SPU_CNTCLR_Bits.RES */
#define IFX_SPU_CNTCLR_RES_OFF (2u)

/** \brief Length for Ifx_SPU_MONITOR_Bits.RAMP */
#define IFX_SPU_MONITOR_RAMP_LEN (11u)

/** \brief Mask for Ifx_SPU_MONITOR_Bits.RAMP */
#define IFX_SPU_MONITOR_RAMP_MSK (0x7ffu)

/** \brief Offset for Ifx_SPU_MONITOR_Bits.RAMP */
#define IFX_SPU_MONITOR_RAMP_OFF (0u)

/** \brief Length for Ifx_SPU_MONITOR_Bits.RES */
#define IFX_SPU_MONITOR_RES_LEN (1u)

/** \brief Mask for Ifx_SPU_MONITOR_Bits.RES */
#define IFX_SPU_MONITOR_RES_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MONITOR_Bits.RES */
#define IFX_SPU_MONITOR_RES_OFF (11u)

/** \brief Length for Ifx_SPU_MONITOR_Bits.SAMPLE */
#define IFX_SPU_MONITOR_SAMPLE_LEN (11u)

/** \brief Mask for Ifx_SPU_MONITOR_Bits.SAMPLE */
#define IFX_SPU_MONITOR_SAMPLE_MSK (0x7ffu)

/** \brief Offset for Ifx_SPU_MONITOR_Bits.SAMPLE */
#define IFX_SPU_MONITOR_SAMPLE_OFF (12u)

/** \brief Length for Ifx_SPU_MONITOR_Bits.IDM_BUSY */
#define IFX_SPU_MONITOR_IDM_BUSY_LEN (1u)

/** \brief Mask for Ifx_SPU_MONITOR_Bits.IDM_BUSY */
#define IFX_SPU_MONITOR_IDM_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MONITOR_Bits.IDM_BUSY */
#define IFX_SPU_MONITOR_IDM_BUSY_OFF (24u)

/** \brief Length for Ifx_SPU_MONITOR_Bits.LDR_BUSY */
#define IFX_SPU_MONITOR_LDR_BUSY_LEN (1u)

/** \brief Mask for Ifx_SPU_MONITOR_Bits.LDR_BUSY */
#define IFX_SPU_MONITOR_LDR_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MONITOR_Bits.LDR_BUSY */
#define IFX_SPU_MONITOR_LDR_BUSY_OFF (25u)

/** \brief Length for Ifx_SPU_MONITOR_Bits.M1_BUSY */
#define IFX_SPU_MONITOR_M1_BUSY_LEN (1u)

/** \brief Mask for Ifx_SPU_MONITOR_Bits.M1_BUSY */
#define IFX_SPU_MONITOR_M1_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MONITOR_Bits.M1_BUSY */
#define IFX_SPU_MONITOR_M1_BUSY_OFF (26u)

/** \brief Length for Ifx_SPU_MONITOR_Bits.UL_BUSY */
#define IFX_SPU_MONITOR_UL_BUSY_LEN (1u)

/** \brief Mask for Ifx_SPU_MONITOR_Bits.UL_BUSY */
#define IFX_SPU_MONITOR_UL_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MONITOR_Bits.UL_BUSY */
#define IFX_SPU_MONITOR_UL_BUSY_OFF (27u)

/** \brief Length for Ifx_SPU_MONITOR_Bits.M2_BUSY */
#define IFX_SPU_MONITOR_M2_BUSY_LEN (1u)

/** \brief Mask for Ifx_SPU_MONITOR_Bits.M2_BUSY */
#define IFX_SPU_MONITOR_M2_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MONITOR_Bits.M2_BUSY */
#define IFX_SPU_MONITOR_M2_BUSY_OFF (28u)

/** \brief Length for Ifx_SPU_MONITOR_Bits.ODM_BUSY */
#define IFX_SPU_MONITOR_ODM_BUSY_LEN (1u)

/** \brief Mask for Ifx_SPU_MONITOR_Bits.ODM_BUSY */
#define IFX_SPU_MONITOR_ODM_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_SPU_MONITOR_Bits.ODM_BUSY */
#define IFX_SPU_MONITOR_ODM_BUSY_OFF (29u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN0_EN */
#define IFX_SPU_ACCEN0_EN0_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN0_EN */
#define IFX_SPU_ACCEN0_EN0_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN0_EN */
#define IFX_SPU_ACCEN0_EN0_EN_OFF (0u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN1_EN */
#define IFX_SPU_ACCEN0_EN1_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN1_EN */
#define IFX_SPU_ACCEN0_EN1_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN1_EN */
#define IFX_SPU_ACCEN0_EN1_EN_OFF (1u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN2_EN */
#define IFX_SPU_ACCEN0_EN2_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN2_EN */
#define IFX_SPU_ACCEN0_EN2_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN2_EN */
#define IFX_SPU_ACCEN0_EN2_EN_OFF (2u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN3_EN */
#define IFX_SPU_ACCEN0_EN3_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN3_EN */
#define IFX_SPU_ACCEN0_EN3_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN3_EN */
#define IFX_SPU_ACCEN0_EN3_EN_OFF (3u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN4_EN */
#define IFX_SPU_ACCEN0_EN4_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN4_EN */
#define IFX_SPU_ACCEN0_EN4_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN4_EN */
#define IFX_SPU_ACCEN0_EN4_EN_OFF (4u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN5_EN */
#define IFX_SPU_ACCEN0_EN5_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN5_EN */
#define IFX_SPU_ACCEN0_EN5_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN5_EN */
#define IFX_SPU_ACCEN0_EN5_EN_OFF (5u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN6_EN */
#define IFX_SPU_ACCEN0_EN6_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN6_EN */
#define IFX_SPU_ACCEN0_EN6_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN6_EN */
#define IFX_SPU_ACCEN0_EN6_EN_OFF (6u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN7_EN */
#define IFX_SPU_ACCEN0_EN7_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN7_EN */
#define IFX_SPU_ACCEN0_EN7_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN7_EN */
#define IFX_SPU_ACCEN0_EN7_EN_OFF (7u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN8_EN */
#define IFX_SPU_ACCEN0_EN8_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN8_EN */
#define IFX_SPU_ACCEN0_EN8_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN8_EN */
#define IFX_SPU_ACCEN0_EN8_EN_OFF (8u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN9_EN */
#define IFX_SPU_ACCEN0_EN9_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN9_EN */
#define IFX_SPU_ACCEN0_EN9_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN9_EN */
#define IFX_SPU_ACCEN0_EN9_EN_OFF (9u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN10_EN */
#define IFX_SPU_ACCEN0_EN10_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN10_EN */
#define IFX_SPU_ACCEN0_EN10_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN10_EN */
#define IFX_SPU_ACCEN0_EN10_EN_OFF (10u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN11_EN */
#define IFX_SPU_ACCEN0_EN11_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN11_EN */
#define IFX_SPU_ACCEN0_EN11_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN11_EN */
#define IFX_SPU_ACCEN0_EN11_EN_OFF (11u)

