Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_bf.h
/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN12_EN */
#define IFX_SPU_ACCEN0_EN12_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN12_EN */
#define IFX_SPU_ACCEN0_EN12_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN12_EN */
#define IFX_SPU_ACCEN0_EN12_EN_OFF (12u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN13_EN */
#define IFX_SPU_ACCEN0_EN13_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN13_EN */
#define IFX_SPU_ACCEN0_EN13_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN13_EN */
#define IFX_SPU_ACCEN0_EN13_EN_OFF (13u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN14_EN */
#define IFX_SPU_ACCEN0_EN14_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN14_EN */
#define IFX_SPU_ACCEN0_EN14_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN14_EN */
#define IFX_SPU_ACCEN0_EN14_EN_OFF (14u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN15_EN */
#define IFX_SPU_ACCEN0_EN15_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN15_EN */
#define IFX_SPU_ACCEN0_EN15_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN15_EN */
#define IFX_SPU_ACCEN0_EN15_EN_OFF (15u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN16_EN */
#define IFX_SPU_ACCEN0_EN16_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN16_EN */
#define IFX_SPU_ACCEN0_EN16_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN16_EN */
#define IFX_SPU_ACCEN0_EN16_EN_OFF (16u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN17_EN */
#define IFX_SPU_ACCEN0_EN17_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN17_EN */
#define IFX_SPU_ACCEN0_EN17_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN17_EN */
#define IFX_SPU_ACCEN0_EN17_EN_OFF (17u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN18_EN */
#define IFX_SPU_ACCEN0_EN18_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN18_EN */
#define IFX_SPU_ACCEN0_EN18_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN18_EN */
#define IFX_SPU_ACCEN0_EN18_EN_OFF (18u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN19_EN */
#define IFX_SPU_ACCEN0_EN19_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN19_EN */
#define IFX_SPU_ACCEN0_EN19_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN19_EN */
#define IFX_SPU_ACCEN0_EN19_EN_OFF (19u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN20_EN */
#define IFX_SPU_ACCEN0_EN20_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN20_EN */
#define IFX_SPU_ACCEN0_EN20_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN20_EN */
#define IFX_SPU_ACCEN0_EN20_EN_OFF (20u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN21_EN */
#define IFX_SPU_ACCEN0_EN21_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN21_EN */
#define IFX_SPU_ACCEN0_EN21_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN21_EN */
#define IFX_SPU_ACCEN0_EN21_EN_OFF (21u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN22_EN */
#define IFX_SPU_ACCEN0_EN22_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN22_EN */
#define IFX_SPU_ACCEN0_EN22_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN22_EN */
#define IFX_SPU_ACCEN0_EN22_EN_OFF (22u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN23_EN */
#define IFX_SPU_ACCEN0_EN23_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN23_EN */
#define IFX_SPU_ACCEN0_EN23_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN23_EN */
#define IFX_SPU_ACCEN0_EN23_EN_OFF (23u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN24_EN */
#define IFX_SPU_ACCEN0_EN24_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN24_EN */
#define IFX_SPU_ACCEN0_EN24_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN24_EN */
#define IFX_SPU_ACCEN0_EN24_EN_OFF (24u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN25_EN */
#define IFX_SPU_ACCEN0_EN25_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN25_EN */
#define IFX_SPU_ACCEN0_EN25_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN25_EN */
#define IFX_SPU_ACCEN0_EN25_EN_OFF (25u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN26_EN */
#define IFX_SPU_ACCEN0_EN26_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN26_EN */
#define IFX_SPU_ACCEN0_EN26_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN26_EN */
#define IFX_SPU_ACCEN0_EN26_EN_OFF (26u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN27_EN */
#define IFX_SPU_ACCEN0_EN27_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN27_EN */
#define IFX_SPU_ACCEN0_EN27_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN27_EN */
#define IFX_SPU_ACCEN0_EN27_EN_OFF (27u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN28_EN */
#define IFX_SPU_ACCEN0_EN28_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN28_EN */
#define IFX_SPU_ACCEN0_EN28_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN28_EN */
#define IFX_SPU_ACCEN0_EN28_EN_OFF (28u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN29_EN */
#define IFX_SPU_ACCEN0_EN29_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN29_EN */
#define IFX_SPU_ACCEN0_EN29_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN29_EN */
#define IFX_SPU_ACCEN0_EN29_EN_OFF (29u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN30_EN */
#define IFX_SPU_ACCEN0_EN30_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN30_EN */
#define IFX_SPU_ACCEN0_EN30_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN30_EN */
#define IFX_SPU_ACCEN0_EN30_EN_OFF (30u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN31_EN */
#define IFX_SPU_ACCEN0_EN31_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN31_EN */
#define IFX_SPU_ACCEN0_EN31_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN31_EN */
#define IFX_SPU_ACCEN0_EN31_EN_OFF (31u)

/** \brief Length for Ifx_SPU_ACCEN1_Bits.RES */
#define IFX_SPU_ACCEN1_RES_LEN (32u)

/** \brief Mask for Ifx_SPU_ACCEN1_Bits.RES */
#define IFX_SPU_ACCEN1_RES_MSK (0xffffffffu)

/** \brief Offset for Ifx_SPU_ACCEN1_Bits.RES */
#define IFX_SPU_ACCEN1_RES_OFF (0u)

/** \brief Length for Ifx_SPU_OCS_Bits.TGS */
#define IFX_SPU_OCS_TGS_LEN (2u)

/** \brief Mask for Ifx_SPU_OCS_Bits.TGS */
#define IFX_SPU_OCS_TGS_MSK (0x3u)
/** \brief Mask for Ifx_SPU_OCS_Bits.TGS */
#define IFX_SPU_OCS_TGS_MSK (0x3u)

/** \brief Offset for Ifx_SPU_OCS_Bits.TGS */
#define IFX_SPU_OCS_TGS_OFF (0u)

