Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_bf.h
/** \brief Length for Ifx_SPU_OCS_Bits.TGB */
#define IFX_SPU_OCS_TGB_LEN (1u)

/** \brief Mask for Ifx_SPU_OCS_Bits.TGB */
#define IFX_SPU_OCS_TGB_MSK (0x1u)
/** \brief Mask for Ifx_SPU_OCS_Bits.TGB */
#define IFX_SPU_OCS_TGB_MSK (0x1u)

/** \brief Offset for Ifx_SPU_OCS_Bits.TGB */
#define IFX_SPU_OCS_TGB_OFF (2u)

/** \brief Length for Ifx_SPU_OCS_Bits.TG_P */
#define IFX_SPU_OCS_TG_P_LEN (1u)

/** \brief Mask for Ifx_SPU_OCS_Bits.TG_P */
#define IFX_SPU_OCS_TG_P_MSK (0x1u)
/** \brief Mask for Ifx_SPU_OCS_Bits.TG_P */
#define IFX_SPU_OCS_TG_P_MSK (0x1u)

/** \brief Offset for Ifx_SPU_OCS_Bits.TG_P */
#define IFX_SPU_OCS_TG_P_OFF (3u)

/** \brief Length for Ifx_SPU_OCS_Bits.RES */
#define IFX_SPU_OCS_RES_LEN (12u)

/** \brief Mask for Ifx_SPU_OCS_Bits.RES */
#define IFX_SPU_OCS_RES_MSK (0xfffu)
/** \brief Mask for Ifx_SPU_OCS_Bits.RES */
#define IFX_SPU_OCS_RES_MSK (0xfffu)

/** \brief Offset for Ifx_SPU_OCS_Bits.RES */
#define IFX_SPU_OCS_RES_OFF (4u)

/** \brief Length for Ifx_SPU_OCS_Bits.TRSCTRL */
#define IFX_SPU_OCS_TRSCTRL_LEN (8u)

/** \brief Mask for Ifx_SPU_OCS_Bits.TRSCTRL */
#define IFX_SPU_OCS_TRSCTRL_MSK (0xffu)
/** \brief Mask for Ifx_SPU_OCS_Bits.TRSCTRL */
#define IFX_SPU_OCS_TRSCTRL_MSK (0xffu)

/** \brief Offset for Ifx_SPU_OCS_Bits.TRSCTRL */
#define IFX_SPU_OCS_TRSCTRL_OFF (16u)

/** \brief Length for Ifx_SPU_OCS_Bits.SUS */
#define IFX_SPU_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_SPU_OCS_Bits.SUS */
#define IFX_SPU_OCS_SUS_MSK (0xfu)
/** \brief Mask for Ifx_SPU_OCS_Bits.SUS */
#define IFX_SPU_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_SPU_OCS_Bits.SUS */
#define IFX_SPU_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_SPU_OCS_Bits.SUS_P */
#define IFX_SPU_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_SPU_OCS_Bits.SUS_P */
#define IFX_SPU_OCS_SUS_P_MSK (0x1u)
/** \brief Mask for Ifx_SPU_OCS_Bits.SUS_P */
#define IFX_SPU_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_SPU_OCS_Bits.SUS_P */
#define IFX_SPU_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_SPU_OCS_Bits.SUSSTA */
#define IFX_SPU_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_SPU_OCS_Bits.SUSSTA */
#define IFX_SPU_OCS_SUSSTA_MSK (0x1u)
/** \brief Mask for Ifx_SPU_OCS_Bits.SUSSTA */
#define IFX_SPU_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_SPU_OCS_Bits.SUSSTA */
#define IFX_SPU_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_SPU_ODA_Bits.DDREN */
#define IFX_SPU_ODA_DDREN_LEN (1u)

/** \brief Mask for Ifx_SPU_ODA_Bits.DDREN */
#define IFX_SPU_ODA_DDREN_MSK (0x1u)
/** \brief Mask for Ifx_SPU_ODA_Bits.DDREN */
#define IFX_SPU_ODA_DDREN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ODA_Bits.DDREN */
#define IFX_SPU_ODA_DDREN_OFF (0u)

/** \brief Length for Ifx_SPU_ODA_Bits.DREN */
#define IFX_SPU_ODA_DREN_LEN (1u)

/** \brief Mask for Ifx_SPU_ODA_Bits.DREN */
#define IFX_SPU_ODA_DREN_MSK (0x1u)
/** \brief Mask for Ifx_SPU_ODA_Bits.DREN */
#define IFX_SPU_ODA_DREN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ODA_Bits.DREN */
#define IFX_SPU_ODA_DREN_OFF (1u)

/** \brief Length for Ifx_SPU_ODA_Bits.RES */
#define IFX_SPU_ODA_RES_LEN (30u)

/** \brief Mask for Ifx_SPU_ODA_Bits.RES */
#define IFX_SPU_ODA_RES_MSK (0x3fffffffu)
/** \brief Mask for Ifx_SPU_ODA_Bits.RES */
#define IFX_SPU_ODA_RES_MSK (0x3fffffffu)

/** \brief Offset for Ifx_SPU_ODA_Bits.RES */
#define IFX_SPU_ODA_RES_OFF (2u)

/** \brief Length for Ifx_SPU_KRST0_Bits.RST */
#define IFX_SPU_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_SPU_KRST0_Bits.RST */
#define IFX_SPU_KRST0_RST_MSK (0x1u)
/** \brief Mask for Ifx_SPU_KRST0_Bits.RST */
#define IFX_SPU_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_SPU_KRST0_Bits.RST */
#define IFX_SPU_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_SPU_KRST0_Bits.RSTSTAT */
#define IFX_SPU_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_SPU_KRST0_Bits.RSTSTAT */
#define IFX_SPU_KRST0_RSTSTAT_MSK (0x1u)
/** \brief Mask for Ifx_SPU_KRST0_Bits.RSTSTAT */
#define IFX_SPU_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_SPU_KRST0_Bits.RSTSTAT */
#define IFX_SPU_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_SPU_KRST0_Bits.RES */
#define IFX_SPU_KRST0_RES_LEN (30u)

/** \brief Mask for Ifx_SPU_KRST0_Bits.RES */
#define IFX_SPU_KRST0_RES_MSK (0x3fffffffu)
/** \brief Mask for Ifx_SPU_KRST0_Bits.RES */
#define IFX_SPU_KRST0_RES_MSK (0x3fffffffu)

/** \brief Offset for Ifx_SPU_KRST0_Bits.RES */
#define IFX_SPU_KRST0_RES_OFF (2u)

/** \brief Length for Ifx_SPU_KRST1_Bits.RST */
#define IFX_SPU_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_SPU_KRST1_Bits.RST */
#define IFX_SPU_KRST1_RST_MSK (0x1u)
/** \brief Mask for Ifx_SPU_KRST1_Bits.RST */
#define IFX_SPU_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_SPU_KRST1_Bits.RST */
#define IFX_SPU_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_SPU_KRST1_Bits.RES */
#define IFX_SPU_KRST1_RES_LEN (31u)

/** \brief Mask for Ifx_SPU_KRST1_Bits.RES */
#define IFX_SPU_KRST1_RES_MSK (0x7fffffffu)
/** \brief Mask for Ifx_SPU_KRST1_Bits.RES */
#define IFX_SPU_KRST1_RES_MSK (0x7fffffffu)

/** \brief Offset for Ifx_SPU_KRST1_Bits.RES */
#define IFX_SPU_KRST1_RES_OFF (1u)

/** \brief Length for Ifx_SPU_KRSTCLR_Bits.CLR */
#define IFX_SPU_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_SPU_KRSTCLR_Bits.CLR */
#define IFX_SPU_KRSTCLR_CLR_MSK (0x1u)
/** \brief Mask for Ifx_SPU_KRSTCLR_Bits.CLR */
#define IFX_SPU_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_SPU_KRSTCLR_Bits.CLR */
#define IFX_SPU_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_SPU_KRSTCLR_Bits.RES */
#define IFX_SPU_KRSTCLR_RES_LEN (31u)

/** \brief Mask for Ifx_SPU_KRSTCLR_Bits.RES */
#define IFX_SPU_KRSTCLR_RES_MSK (0x7fffffffu)
/** \brief Mask for Ifx_SPU_KRSTCLR_Bits.RES */
#define IFX_SPU_KRSTCLR_RES_MSK (0x7fffffffu)

/** \brief Offset for Ifx_SPU_KRSTCLR_Bits.RES */
#define IFX_SPU_KRSTCLR_RES_OFF (1u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSPU_BF_H */
